app/controllers/schools_controller.rb

SELECT `schools`.* FROM `schools`
---
  def index
    @schools = School.all

INSERT INTO `schools` (`name`, `school_type`, `created_at`, `updated_at`) VALUES ('jigyasa', 'montessori', '2017-11-24 15:32:19', '2017-11-24 15:32:19')
---
  def create
    @school = School.new(school_params)

    respond_to do |format|
      if @school.save

SELECT `students`.* FROM `students` WHERE `students`.`school_id` IS NULL AND `students`.`ordered` = 1
SELECT `anonymous_users`.* FROM `anonymous_users` WHERE `anonymous_users`.`school_id` IS NULL
SELECT `students`.`commision` FROM `students` WHERE `students`.`school_id` = 1
SELECT `anonymous_users`.`commision` FROM `anonymous_users` WHERE `anonymous_users`.`school_id` = 1
---
  def info
    @ordered_student = Student.where(:school_id => params[:id],:ordered => true)
    @unordered_student = Student.where(:school_id => params[:id],:ordered => false)
    @anonymous_users = AnonymousUser.where(:school_id => params[:school_id])
    @commision_ordered = Student.where(:school_id => params[:id]).pluck(:commision).sum
    @commision_users = AnonymousUser.where(:school_id => params[:id]).pluck(:commision).sum

SELECT  `schools`.* FROM `schools` WHERE `schools`.`id` = 1 LIMIT 1
---
    def set_school
      @school = School.find(params[:id])