app/controllers/students_controller.rb

INSERT INTO `students` (`name`, `rollno`, `parent_primary_email`, `parent_primary_phone`, `classname`, `ordered`, `payment_token`, `school_id`, `created_at`, `updated_at`) VALUES ('Bagavathi', '12bcs043', 'bagavathisundaram@gmail.com', '07708938805', 'hfn', 0, 'hf', 1, '2017-11-24 15:33:57', '2017-11-24 15:33:57')
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save

UPDATE `students` SET `ordered` = 1, `updated_at` = '2017-11-26 07:23:47' WHERE `students`.`id` = 1
---
  def update
    respond_to do |format|
      if @student.update(student_params)

SELECT  `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1
---
    def set_student
      @student = Student.find(params[:id])